src/Documents/СД_Заявка/СД_Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="dd884d26-cef7-4ee5-928a-cf898ed269f2">
  <name>СД_Заявка</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="15f46283-54f7-48ef-a5e8-9eb85aff1153">
    <name>ТемаЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="325efba9-8467-4c2f-85f3-3616245ff630">
    <name>Сервис</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_Сервисы</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e5d59f79-79c9-4f7c-81e1-c7baed11fecb">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.СД_СпособыСоздания</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="40d006d1-31b1-4c03-b927-2f3e3232f015">
    <name>ИннициаторЗаявкиАдресЭлПочты</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="82253011-7877-4f03-8b69-9b94f487a8f8">
    <name>Примечание</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6ef42f5f-532d-4072-8a34-c052799b6365">
    <name>ВидЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ВидыЗаявок</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="75e52cec-543a-4143-bffb-a75f2b219550">
    <name>ИннициаторЗаявкиИмяОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="759a06b0-6d20-49ce-bed2-5a470e74ff85">
    <name>УчетнаяЗаписьПолученияЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="263baaae-a575-4f3e-9970-96da3c1d4231">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="87523878-293d-4a0b-80f8-26e341f648ce">
    <name>ИнициаторЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="7634e8d6-85ec-4663-8376-d377e2c7870d">
    <name>Проект</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="1479f7d5-6902-4658-a27e-fc569da4b92d">
    <name>ПродолжениеЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.СД_Заявка</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8c420815-9453-413a-8229-a2fdba058602">
    <name>ПроблемаИнцидент</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.СД_ПроблемаИнцидент</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="f6697eea-c58d-4fca-920f-7aafd944fc4d">
    <name>ОборудованиеПредприятия</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СД_ОборудованиеПредприятия</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="29031e78-6fa3-4c0c-947c-5470ffd8e2ec">
    <name>Ч_ТипЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.Ч_ТипыЗаявокСД</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8409f1b3-8158-4a7e-b764-2c99f6de21f9">
    <name>Ч_ПлановоеВремяЗакрытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="11dd4a2c-ef4b-4e51-a146-5fcd125305f8">
    <name>Ч_Предмет</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.ВходящееПисьмо</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/СД_Решение/СД_Решение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4e563ab8-0bdb-41e4-81d0-c03cd64d25cd">
  <name>СД_Решение</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="374a73c0-8dbb-40a3-ab9c-9ccbbb7606ca">
    <name>Заявка</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.СД_Заявка</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="3d4e4238-0c03-4a83-bea5-4c89b4b16490">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="2d67b1c9-8e01-4d59-ba84-cf58126dddc9">
    <name>Проект</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="b0e92f9d-493f-4133-bb14-24268d71da8d">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="773ad657-a817-41bb-8f20-9a6149bc5053">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/СД_Заявка/Forms/ФормаЗакрытияВручную/Module.bsl
&НаСервере
&Вместо("СоздатьРешениеПоЗаявке")
Функция ЧСД_СоздатьРешениеПоЗаявке()
	ТекущийПользователь=Пользователи.ТекущийПользователь();
	
	ДокРешение=Документы.СД_Решение.СоздатьДокумент();
	ДокРешение.Дата=ТекущаяДата();
	ДокРешение.Заявка=ЗаявкаВТехПоддержку;
	ДокРешение.Автор=ТекущийПользователь;
	ДокРешение.Комментарий="Создано при ручном закрытии заявки";
	
	//установим текст решения
	ФормТекст=Новый ФорматированныйДокумент;
	ФормТекст.УстановитьHTML(ТекстРешения, Новый Структура);
	
	ДокРешение.ОписаниеРешенияХранилищеФорматированногоТекста=Новый ХранилищеЗначения(ФормТекст);
	ДокРешение.ОписаниеРешенияТекст=ТекстРешения;	
	
	ДокРешение.Подразделение=ТекущийПользователь.Подразделение;

	Попытка
		ДокРешение.Записать();
	Исключение
		СД_ОбщееВызовСервера.ЗаписатьОшибку(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	// savilov отправляю уведомление 
	СД_ИнтернетШлюзСервер.ОтправитьРешениеИнициатору(ДокРешение.Ссылка);
	// /savilov
	Возврат Истина;
	
КонецФункции
